[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:57:42
                             id="requesterEmail"
                             type="text"
                             isInvalid={Boolean(errors.requesterEmail)}
-                            {...register("requesterEmail", { required: "Requester Email is required."})}
+                            {...register("", { required: "Requester Email is required."})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:75:30
                             {...register("requestTime", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requestTime && 'Request time is required.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Request time is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:75:30
                             {...register("requestTime", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requestTime && 'Request time is required.'}
+                            {errors.requestTime || 'Request time is required.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.
