[Killed] BooleanLiteral
main/pages/UCSBDiningCommonsMenu/UCSBDiningCommonsMenuCreatePage.js:7:68
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function UCSBDiningCommonsMenuCreatePage({storybook=false}) {
+export default function UCSBDiningCommonsMenuCreatePage({storybook=true}) {
 
   const objectToAxiosParams = (ucsbdiningcommonsmenu) => ({
killedBy: UCSBDiningCommonsMenuCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenu
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ucsbdiningcommonsmenu"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenu/UCSBDiningCommonsMenuCreatePage.js:9:31
 
 export default function UCSBDiningCommonsMenuCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (ucsbdiningcommonsmenu) => ({
-    url: "/api/ucsbdiningcommonsmenu/post",
-    method: "POST",
-    params: {
-      diningCommonsCode: ucsbdiningcommonsmenu.diningCommonsCode,
-      name: ucsbdiningcommonsmenu.name,
-      station: ucsbdiningcommonsmenu.station 
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsbDiningCommonsMenu) => {
killedBy: UCSBDiningCommonsMenuCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenu
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenu/UCSBDiningCommonsMenuCreatePage.js:11:13
 
   const objectToAxiosParams = (ucsbdiningcommonsmenu) => ({
     url: "/api/ucsbdiningcommonsmenu/post",
-    method: "POST",
+    method: "",
     params: {
       diningCommonsCode: ucsbdiningcommonsmenu.diningCommonsCode,
killedBy: UCSBDiningCommonsMenuCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenu
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenu/UCSBDiningCommonsMenuCreatePage.js:19:48
     }
   });
 
-  const onSuccess = (ucsbDiningCommonsMenu) => {
-    toast(`New UCSBDiningCommonsMenu Created - id: ${ucsbDiningCommonsMenu.id} name: ${ucsbDiningCommonsMenu.name}`);
-  }
+  const onSuccess = (ucsbDiningCommonsMenu) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenu
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New UCSBDiningCommonsMenu Created - id: 3 name: Turkey Sandwich"

Number of calls: 0

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenu/UCSBDiningCommonsMenuCreatePage.js:36:32
     mutation.mutate(data);
   }
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/ucsbdiningcommonsmenu" />
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: UCSBDiningCommonsMenuCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenu
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ucsbdiningcommonsmenu"}

Number of calls: 0
