[Killed] BooleanLiteral
main/pages/UCSBDiningCommonsMenu/UCSBDiningCommonsMenuEditPage.js:8:66
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function UCSBDiningCommonsMenuEditPage({storybook=false}) {
+export default function UCSBDiningCommonsMenuEditPage({storybook=true}) {
     let { id } = useParams();
 
killedBy: UCSBDiningCommonsMenuEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ucsbdiningcommonsmenu"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenu/UCSBDiningCommonsMenuEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (ucsbdiningcommonsmenu) => ({
-        url: "/api/ucsbdiningcommonsmenu",
-        method: "PUT",
-        params: {
-            id: ucsbdiningcommonsmenu.id,
-        },
-        data: {
-          diningCommonsCode: ucsbdiningcommonsmenu.diningCommonsCode,
-          name: ucsbdiningcommonsmenu.name,
-          station: ucsbdiningcommonsmenu.station 
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (ucsbdiningcommonsmenu) => {
killedBy: UCSBDiningCommonsMenuEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDiningCommonsMenu Updated - id: 17 name: Huge Burritos"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenu/UCSBDiningCommonsMenuEditPage.js:27:17
     const objectToAxiosPutParams = (ucsbdiningcommonsmenu) => ({
         url: "/api/ucsbdiningcommonsmenu",
         method: "PUT",
-        params: {
-            id: ucsbdiningcommonsmenu.id,
-        },
+        params: {},
         data: {
           diningCommonsCode: ucsbdiningcommonsmenu.diningCommonsCode,
killedBy: UCSBDiningCommonsMenuEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "id": 17,
- }

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenu/UCSBDiningCommonsMenuEditPage.js:30:15
         params: {
             id: ucsbdiningcommonsmenu.id,
         },
-        data: {
-          diningCommonsCode: ucsbdiningcommonsmenu.diningCommonsCode,
-          name: ucsbdiningcommonsmenu.name,
-          station: ucsbdiningcommonsmenu.station 
-        }
+        data: {}
     });
 
killedBy: UCSBDiningCommonsMenuEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"diningCommonsCode\":\"Ortega\",\"name\":\"Huge Burritos\",\"station\":\"Entree\"}"
Received: "{}"

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenu/UCSBDiningCommonsMenuEditPage.js:37:50
         }
     });
 
-    const onSuccess = (ucsbdiningcommonsmenu) => {
-        toast(`UCSBDiningCommonsMenu Updated - id: ${ucsbdiningcommonsmenu.id} name: ${ucsbdiningcommonsmenu.name}`);
-    }
+    const onSuccess = (ucsbdiningcommonsmenu) => {}
 
     const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] LogicalOperator
main/pages/UCSBDiningCommonsMenu/UCSBDiningCommonsMenuEditPage.js:63:21
             <div className="pt-2">
                 <h1>Edit UCSBDiningCommonsMenu</h1>
                 {
-                    ucsbdiningcommonsmenu && <UCSBDiningCommonsMenuForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={ucsbdiningcommonsmenu} />
+                    ucsbdiningcommonsmenu || <UCSBDiningCommonsMenuForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={ucsbdiningcommonsmenu} />
                 }
             </div>
killedBy: UCSBDiningCommonsMenuEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, diningCommonsCode, name, station}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/pages/UCSBDiningCommonsMenu/UCSBDiningCommonsMenuEditPage.js:63:21
             <div className="pt-2">
                 <h1>Edit UCSBDiningCommonsMenu</h1>
                 {
-                    ucsbdiningcommonsmenu && <UCSBDiningCommonsMenuForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={ucsbdiningcommonsmenu} />
+                    false
                 }
             </div>
killedBy: UCSBDiningCommonsMenuEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
