[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenu/UCSBDiningCommonsMenuIndexPage.js:17:23
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             ["/api/ucsbdiningcommonsmenu/all"],
-            { method: "GET", url: "/api/ucsbdiningcommonsmenu/all" },
+            { method: "", url: "/api/ucsbdiningcommonsmenu/all" },
             // Stryker disable next-line all : don't test default value of empty list
             []
killedBy: UCSBDiningCommonsMenuIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/ucsbdiningcommonsmenu/all"
Received string:    "Error communicating with backend via  on /api/ucsbdiningcommonsmenu/all"

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenu/UCSBDiningCommonsMenuIndexPage.js:22:32
             []
         );
 
-    const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN")) {
-            return (
-                <Button
-                    variant="primary"
-                    href="/ucsbdiningcommonsmenu/create"
-                    style={{ float: "right" }}
-                >
-                    Create UCSBDiningCommonsMenu
-                </Button>
-            )
-        } 
-    }
+    const createButton = () => {}
 
     return (
killedBy: UCSBDiningCommonsMenuIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create UCSBDiningCommonsMenu/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
