[Killed] BlockStatement
src/main/utils/UCSBDiningCommonsMenuUtils.js:8:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/ucsbdiningcommonsmenu",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 
killedBy: UCSBDiningCommonsMenuIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDiningCommonsMenu with id Portola was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
src/main/utils/UCSBDiningCommonsMenuUtils.js:10:14
 
 export function cellToAxiosParamsDelete(cell) {
     return {
-        url: "/api/ucsbdiningcommonsmenu",
+        url: "",
         method: "DELETE",
         params: {
killedBy: UCSBDiningCommonsMenuIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDiningCommonsMenu with id Portola was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
src/main/utils/UCSBDiningCommonsMenuUtils.js:11:17
 export function cellToAxiosParamsDelete(cell) {
     return {
         url: "/api/ucsbdiningcommonsmenu",
-        method: "DELETE",
+        method: "",
         params: {
             id: cell.row.values.id
killedBy: UCSBDiningCommonsMenuIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDiningCommonsMenu with id Portola was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
