[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenu/UCSBDiningCommonsMenuForm.js:46:55
                     id="diningCommonsCode "
                     type="text"
                     isInvalid={Boolean(errors.diningCommonsCode )}
-                    {...register("diningCommonsCode", {
-                        required: "diningCommonsCode is required.",
-                        maxLength : {
-                            value: 30,
-                            message: "diningCommonsCode max length 30 characters"
-                        }
-                    })}
+                    {...register("diningCommonsCode", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /diningCommonsCode is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenu/UCSBDiningCommonsMenuForm.js:66:42
                     id="name"
                     type="text"
                     isInvalid={Boolean(errors.name)}
-                    {...register("name", {
-                        required: "Name is required.",
-                        maxLength : {
-                            value: 30,
-                            message: "name max length 30 characters"
-                        }
-                    })}
+                    {...register("name", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Name is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
