[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenu/UCSBDiningCommonsMenuEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (ucsbdiningcommonsmenu) => ({
-        url: "/api/ucsbdiningcommonsmenu",
-        method: "PUT",
-        params: {
-            id: ucsbdiningcommonsmenu.id,
-        },
-        data: {
-            diningCommonsCode: ucsbdiningcommonsmenu.diningCommonsCode,
-            name: ucsbdiningcommonsmenu.name,
-            station: ucsbdiningcommonsmenu.station,
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (ucsbdiningcommonsmenu) => {
killedBy: UCSBDiningCommonsMenuEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDiningCommonsMenu Updated - id: 17 name: Huge Burritos"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenu/UCSBDiningCommonsMenuEditPage.js:30:15
         params: {
             id: ucsbdiningcommonsmenu.id,
         },
-        data: {
-            diningCommonsCode: ucsbdiningcommonsmenu.diningCommonsCode,
-            name: ucsbdiningcommonsmenu.name,
-            station: ucsbdiningcommonsmenu.station,
-        }
+        data: {}
     });
 
killedBy: UCSBDiningCommonsMenuEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"diningCommonsCode\":\"Ortega\",\"name\":\"Huge Burritos\",\"station\":\"Entree\"}"
Received: "{}"
