[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:72:51
                     id="reviewerEmail"
                     type="text"
                     isInvalid={Boolean(errors.reviewerEmail)}
-                    {...register("reviewerEmail", {
-                        required: "Reviewer Email is required.",
-                        pattern: {
-                            value: email_regex,
-                            message: "Reviewer Email must be a valid email address"
-                        },
-                    })}
+                    {...register("reviewerEmail", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:74:34
                     isInvalid={Boolean(errors.reviewerEmail)}
                     {...register("reviewerEmail", {
                         required: "Reviewer Email is required.",
-                        pattern: {
-                            value: email_regex,
-                            message: "Reviewer Email must be a valid email address"
-                        },
+                        pattern: {},
                     })}
                 />
killedBy: MenuItemReviewForm tests Collect Error messages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer Email must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:114:34
                     isInvalid={Boolean(errors.dateReviewed)}
                     {...register("dateReviewed", {
                         required: "Date Reviewed is required.",
-                        pattern: {
-                            value: isodate_regex,
-                            message: "Date Reviewed must be a valid date"
-                        },
+                        pattern: {},
                     })}
                 />
killedBy: MenuItemReviewForm tests Collect Error messages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Reviewed must be a valid date/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:116:38
                         required: "Date Reviewed is required.",
                         pattern: {
                             value: isodate_regex,
-                            message: "Date Reviewed must be a valid date"
+                            message: ""
                         },
                     })}
killedBy: MenuItemReviewForm tests Collect Error messages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Reviewed must be a valid date/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
