[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:11:20
 export default function MenuItemReviewTable({
     menuitemreviews,
     currentUser,
-    testIdPrefix = "MenuItemReviewTable"}) {
+    testIdPrefix = ""}) {
     const navigate = useNavigate();
     const editCallback = (cell) => {
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewTable-header-itemId"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/MenuItemReview/MenuItemReviewTable.js:13:36
     currentUser,
     testIdPrefix = "MenuItemReviewTable"}) {
     const navigate = useNavigate();
-    const editCallback = (cell) => {
-        navigate(`/menuitemreview/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: MenuItemReviewTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/menuitemreview/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:38:9
             Header: 'Item ID',
             accessor: 'itemId',
         },
-        {
-            Header: 'Reviewer Email',
-            accessor: 'reviewerEmail',
-        },
+        {},
         {
             Header: 'Stars',
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:42:9
             Header: 'Reviewer Email',
             accessor: 'reviewerEmail',
         },
-        {
-            Header: 'Stars',
-            accessor: 'stars',
-        },
+        {},
         {
             Header: 'Date Reviewed',
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:48:23
         },
         {
             Header: 'Date Reviewed',
-            accessor: 'dateReviewed',
+            accessor: "",
         },
         {
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewTable-header-dateReviewed"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:51:21
             accessor: 'dateReviewed',
         },
         {
-            Header: 'Comments',
+            Header: "",
             accessor: 'comments',
         }
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Comments. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
