[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:9:33
 
 export default function MenuItemReviewCreatePage({ storybook = false }) {
 
-    const objectToAxiosParams = (menuitemreview) => ({
-        url: "/api/menuitemreview/post",
-        method: "POST",
-        params: {
-            itemId: menuitemreview.itemId,
-            reviewerEmail: menuitemreview.reviewerEmail,
-            stars: menuitemreview.stars,
-            dateReviewed: menuitemreview.dateReviewed,
-            comments: menuitemreview.comments,
-        }
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (menuitemreview) => {
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuitemreview
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:9:54
 
 export default function MenuItemReviewCreatePage({ storybook = false }) {
 
-    const objectToAxiosParams = (menuitemreview) => ({
-        url: "/api/menuitemreview/post",
-        method: "POST",
-        params: {
-            itemId: menuitemreview.itemId,
-            reviewerEmail: menuitemreview.reviewerEmail,
-            stars: menuitemreview.stars,
-            dateReviewed: menuitemreview.dateReviewed,
-            comments: menuitemreview.comments,
-        }
-    });
+    const objectToAxiosParams = (menuitemreview) => ({});
 
     const onSuccess = (menuitemreview) => {
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuitemreview
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:10:14
 export default function MenuItemReviewCreatePage({ storybook = false }) {
 
     const objectToAxiosParams = (menuitemreview) => ({
-        url: "/api/menuitemreview/post",
+        url: "",
         method: "POST",
         params: {
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuitemreview
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New MenuItemReview Created - id: 1337 itemId: 1337 reviewerEmail: testtest@ucsb.edu stars: 2 dateReviewed: 2023-08-11T12:00:00.000Z comments: This is 1337"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:34:48
 
     const { isSuccess } = mutation;
 
-    const onSubmit = async (menuitemreview) => {
-        mutation.mutate(menuitemreview);
-    }
+    const onSubmit = async (menuitemreview) => {}
 
     if (isSuccess && !storybook) {
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuitemreview
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
